results/results_m5_large/results_m5_large_run2/oltp_read_write_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 85.48 qps: 1740.05 (r/w/o: 1222.35/107.98/409.72) lat (ms,95%): 559.50 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 85.10 qps: 1697.75 (r/w/o: 1188.34/106.10/403.31) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 87.20 qps: 1747.81 (r/w/o: 1224.51/108.40/414.90) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 69.60 qps: 1394.69 (r/w/o: 976.29/88.50/329.90) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 81.00 qps: 1626.81 (r/w/o: 1140.51/98.90/387.40) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 80.80 qps: 1615.49 (r/w/o: 1130.60/102.30/382.60) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 77.80 qps: 1548.50 (r/w/o: 1082.00/98.50/368.00) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 76.80 qps: 1538.51 (r/w/o: 1076.21/97.50/364.80) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 81.60 qps: 1628.90 (r/w/o: 1141.10/102.40/385.40) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 76.60 qps: 1537.10 (r/w/o: 1075.90/98.30/362.90) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 79.50 qps: 1582.70 (r/w/o: 1107.10/100.80/374.80) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 84.50 qps: 1694.49 (r/w/o: 1187.70/107.80/399.00) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            135688
        write:                           12212
        other:                           45940
        total:                           193840
    transactions:                        9692   (80.55 per sec.)
    queries:                             193840 (1610.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      80.5470
    time elapsed:                        120.3273s
    total number of events:              9692

Latency (ms):
         min:                                  178.41
         avg:                                  396.91
         max:                                 1078.12
         95th percentile:                      623.33
         sum:                              3846854.96

Threads fairness:
    events (avg/stddev):           302.8750/1.76
    execution time (avg/stddev):   120.2142/0.09